// 변수의 shadowing
// 서로 다른 함수에서 같은 변수를 선언

/*
함수 안에서 밖에서도 선언되었던 같은 이름의 변수를 사용하는 경우
        1. 함수 밖의 변수는 잠시 가려짐 (shadowing)
        2. 함수 안에서는 해당 함수에서의 변수를 사용 (함수 밖 변수의 값은 변하지 않음)
        3. 함수에서 빠져나오면 다시 해당 변수에 접근할 수 있음

함수 안에서만 값이 유지되어야 하는 경우
        1. 함수 안에서 var 키워드를 사용해 선언하고 사용

여러 함수에서 값이 유지되면서 사용되는 변수의 경우
        1. 함수를 포괄하는 곳에서 선언하고 사용
*/

function shadowing_example(){
    var val=0;
    console.log("F", val);  // F 0 출력
    val++;
    // 함수안에 선언된 변수 val의 값이 1이됨
}

var val=0;
shadowing_example();
console.log("O", val);  // O 0 출력
// 함수 안에 있던 변수 val은 가려지고 다시 함수 밖에 있는 val이 나타남.